# Most commonly used Sentinel Tables

While configuring SOCs, we often get below questions:

- **What data is in which Sentinel table?**
- **Where can I find X or Y data?**

## 01 EntraID Sign-in Logs

```
// show all successful logins
SigninLogs
| where AppDisplayName == "Azure Portal"
    and ResultType == 0
```

## 02 AuditLogs

- This table contains the audit log of the Azure Active Directory.

```
# show all newly created users
AuditLogs
| where OperationName == "Add user"

# show all PIM requests
AuditLogs
| where OperationName == "Add member to role requested (PIM activation)"
     or OperationName == "Remove member from role completed (PIM deactivate)"
| extend Account = tostring(InitiatedBy.["user"].["userPrincipalName"])
| distinct TimeGenerated, Account, ResultDescription
```

## 03 AzureActivity

- This table contains the audit log of the Azure Resource Manager.

```
# Shows all password resets on linux VMs
AzureActivity
| where Resource contains "VMAccessLinuxPasswordReset"
    and ActivityStatus == "Succeeded"


# Shows all new Azure Role assignments
AzureActivity
| where ResourceProvider == "Microsoft.Authorization'
    and OperationNameValue == "Microsoft.Authorization/roleAssignments/write"
    and ActivityStatus == "Succeeded"

# Logs related to Azure VM Deletes
 AzureActivity
  | where OperationNameValue == "MICROSOFT.COMPUTE/VIRTUALMACHINES/DELETE"
  | where ActivityStatusValue == "Success"

```

## 04 OfficeActivity

- This table contains all Office 365 related events:
  - Microsoft Exchange 365
  - Microsoft SharePoint 365
  - OneDrive

```
# Get all Exchange related events
OfficeActivity
| where OfficeWorkload == "Exchange"

# Get all SharePoint and OneDrive related events
OfficeActivity
| where OfficeWorkload == "SharePoint"

# Get all OneDrive related Events & Sort it by Time
OfficeActivity
| where OfficeWorkload == "SharePoint" or OfficeWorkload == "OneDrive"
| sort by TimeGenerated

```

## 05 SecurityEvents

- This table contains all security events from the _Windows machines_ connected to your Microsoft Sentinel workspace using the AMA.

```
# Get all login events that are not produced by NT Authority\System
SecurityEvent
| where EventID == "4624"
  and Account <> "NT AUTHORITY\\SYSTEM"

```

## 06 ThreatIntelligenceIndicator

- This table is used to store custom threat intelligence logs.
- Threat intelligence of various services such as MISP or Pulsedive can be forwarded to Azure Sentinel and stored in this table.

```
ThreatIntelligenceIndicator
| limit 100
```

## 07 Syslog

- If you have any Linux machines connected to Log Analytics, this table will contain all events that are forwarded by Syslog.
- It might contain some network devices logs which support syslog.

```
# Get all logs from the cron deamon in linux
Syslog
| where ProcessName == "CRON"
```

## 08 SecurityAlerts

- This table contains connected Microsoft security products logs such as:
  - Microsoft Defender for Cloud
  - Microsoft Defender for Endpoint
  - Azure AD Identity Protection
  - Cloud App Security
- This table will contain the alerts that have been generated by these products.

```
# Get all alerts reported by Microsoft Cloud App Security
SecurityAlert
| where ProviderName == "MCAS"

# Get all alerts reported by Microsoft Sentinel
SecurityAlert
| where ProviderName == "Azure Sentinel"

```

## 09 AzureDiagnostics

- This table contains diagnostic data from all resources that have been configured to send diagnostic logs to your log analytics workspace. E.g. Azure SQL database, Azure Virtual Machine

```
# Get all SQL successfull authentications
AzureDiagnostics
| where clientIP_s != ""
| where ResourceProvider == "MICROSOFT.SQL"
and action_name_s == "DATABASE AUTHENTICATION SUCCEEDED"

```
