## Hands-on Labs:

### 01-Create an analytics rule from rule templates

### 02-Create an analytics rule from scratch

- **Analytics Rule Type**: Scheduled Alert/NRT/Fusion
- **General settings**
- **Set Rule logic** (KQL Query)
- **Incident settings**
  - Grouping alerts into a single incident/separate incident
- **Automated response**
- **Review** and **Create**

### 03-Manage existing analytic rules

- You can perform the following four actions on existing active rules:
  - Edit
  - Disable
  - Duplicate
  - Delete

### Exercise-01 - Threat detection with Microsoft Sentinel analytics

- **Task-01: Create a custom analytics rule**
  - Navigate to **Microsoft Sentinel** >> under Configuration, select **Analytics**.
  - **Analytics rule type**: Scheduled query rule
  - Set rule logic:
  ```
  AzureActivity
  | where OperationNameValue == "MICROSOFT.COMPUTE/VIRTUALMACHINES/DELETE"
  | where ActivityStatusValue == "Success"
  ```
  - In the Results **simulation** pane, select **Test with current data**, and then observe the results.
- **Task 2: Invoke an incident and review the associated actions**
  - In order to trigger the analtics rule, you must create an Azure VM and then delete it.
  - Once Azure VM is deleted, navigate to **Sentinel** >> **Incidents**
